Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/checklists/checklist_glossary_of_employment_terms.html.txt.tmx
Source language: en
Languages: ga

source: Glossary of employment terms
ga: Gluais de théarmaí fostaíochta

source: │Adoptive leave │Adoptive leave is leave from work for an adoptive mother or sole male adopter │ │ │after the adoption of a child
ga: │Saoire uchtaíoch │Ciallaíonn saoire uchtaíoch saoire ón obair do mháthair uchtaíoch nó uchtaitheoir fir aonair tar éis leanbh a uchtú

source: │Agency worker │Someone who is employed by an agency to work for another person or company
ga: │Oibrí gníomhaireachta │Duine atá fostaithe ag gníomhaireacht chun obair a dhéanamh do dhuine nó do chuideachta eile

source: │Annual leave │Annual leave is paid time off work for holidays, rest or recreation
ga: │Saoire bhliantúil │Ciallaíonn saoire bhliantúil am saor ón obair atá íoctha le haghaidh laethanta saoire, scíthe nó áineasa

source: │Benefit-in-kind│A term used by Revenue to refer to a taxable non-cash payment to an employee, │ │ │for example, the use of a car
ga: │Sochar comhchineáil │Téarma a úsáideann na Coimisinéirí Ioncaim chun tagairt d’íocaíocht neamhairgid atá inchánach, mar shampla, úsáid cairr

source: │Breaks │Short periods of time for rest and refreshment taken during working hours
ga: │Sosanna │Tréimhsí ama gearr chun sos agus sólaistí a ghlacadh le linn uaireanta oibre

source: │Bullying │In the workplace bullying is repeated inappropriate behaviour by one or more │ │ │people against another person or people
ga: │Bulaíocht │San ionad oibre, ciallaíonn bulaíocht iompraíocht mhíchuí leanúnach ó dhuine nó ó dhaoine i gcoinne duine nó daoine eile

source: ├───────────────┼───────────────────────────────────────────────────────────────────────────────┤ │ │Carer’s leave is leave from work to care someone who is deemed by the │ │Carer’s leave │Department of Social Protection as being in need of full-time care and │ │ │attention
ga: │Saoire chúramóra │Ciallaíonn saoire chúramóra saoire ón obair chun cúram a thabhairt do dhuine a mheasann an Roinn Coimirce Sóisialaí go bhfuil cúram agus aird lánaimseartha ag teastáil uathu

source: │Casual worker │A person employed as required without fixed hours or attendance arrangements │
ga: │Oibrí ócáideach │Duine atá fostaithe de réir mar atá siad ag teastáil gan uaireanta seasta nó socruithe tinrimh │

source: │Code of │A code of practice sets out good practice in employment but is not usually │
ga: │Cód cleachtais │Leagann cód cleachtais amach dea-chleachtas i gcúrsaífostaíochta ach ní bhíonn ceanglas dlí i gceist go hiondúil │

source: │Collective │Agreements negotiated between unions and employers about terms and conditions │ │agreements │of employment
ga: │Comhaontuithe comhchoiteann │Comhaontuithe idir ceardchumainn agus fostóirí faoi théarmaí agus coinníollacha fostaíochta

source: │Common law │Law derived from custom and court decisions, rather than legislation
ga: │Dlí coiteann │Dlí atá díorthaithe ó ghnás agus cinntí cúirte, seachas ón reachtaíocht

source: │Constructive │Constructive dismissal is when you terminate your contract of employment │ │dismissal │because of your employer’s behaviour
ga: │Dífhostú inchiallaithe │Ciallaíonn dífhostú inchiallaithe nuair a bhristear do chonradh fostaíochta toisc iompraíocht an fhostóra

source: │Permit │salary of €30,000 to €60,000
ga: Sampla amháin ná briseadh caife neamhfhoirmiúil ag 11rn

source: │Custom and │Custom and practice is where a term of employment is set up by normal behaviour│ │practice │in a workplace rather than by legislation or a written contract. One example is│
ga: │Asbhaintí │Ciallaíonn asbhaintí na méideanna a bhaintear ó do phá agus déantar iad a liostáil ar do dhuillín pá, mar shampla, ÁSPC

source: │Disciplinary │It sets out in writing how the employer will deal with the alleged shortcomings│ │procedure │of an employee
ga: │Nós imeachta araíonachta │Leagann sé amach i scríbhinn conas a dhéileálfaidh an fostóir le heasnaimh líomhnaithe an fhostaí

source: ├───────────────┼───────────────────────────────────────────────────────────────────────────────┤ │ │This means treating one person less favourably than another person
ga: │Idirdhealú │Ciallaíonn sé seo go ndéantar déileáil níos fabhraí le duine amháin seachas duine eile Bíonn idirdhealú san ionad oibre neamhdhleathach má tá sé bunaithe ar inscne, stádas sibhialta, stádas teaghlaigh, claonadh gnéasach, reiligiún, aois, míchumas, cine nó ballraíocht de phobal an Lucht Siúil

source: │Discrimination │Discrimination at work is illegal if it is based on gender, civil status, │
ga: │Dífhostú │Tarlaíonn dífhostú nuair a thagann deireadh le conradh fostaíochta

source: │ │family status, sexual orientation, religion, age, disability, race, membership │ │ │of the Traveller community
ga: Má dhéanann fostóir dífhostú ort, d’fhéadfá éileamh a dhéanamh ar dhífhostú éagórach

source: │Dismissal │This occurs when your contract of employment is ended. If you are dismissed by │ │ │your employer you may be able to claim unfair dismissal
ga: │Oibrí baile │Ciallaíonn oibrí baile duine atá fostaithe chun obair a dhéanamh i dteach príobháideach

source: │Domestic worker│A domestic worker is someone who is employed to work in a private home
ga: Ciallaíonn sé seo nár chóir go mbeadh dualgas ort oibriú faoi choinníollacha nach bhfuil sábháilte nó atá míshláintiúil

source: │ │Your employer owes you a duty of care to provide a safe workplace and this is │
ga: │Fostaí │Ciallaíonn fostaí duine a oibríonn do dhuine eile ar son íocaíochta

source: │ │have to work in unsafe or unhealthy conditions. │
ga: Níl aon sainmhíniú ar 'fhostaí' sa dlí fostaíochta

source: │ │An employee is someone works for someone else in return for payment
ga: Cinneann na Coimisinéirí Ioncaim nó an Roinn Coimirce Sóisialaí stádas fostaíochta an duine go ginearálta

source: │Employee │determining Employment Status (pdf) contains criteria which can be used to │ │ │clarify whether a person is employed or self-employed. The employment status of│
ga: │Cead fostaíochta │Caithfidh tromlach na náisiúnach nach as an LEE dóibh cead fostaíochta a bheith acu chun fostaíocht a fháil in Éirinn

source: │Employment │Most non-EEA nationals must have an employment permit in order to take up │ │permit │employment in Ireland
ga: │Ordú Rialaithe Fostaíochta (ORF) │Déanann Comhchoistí Saothair idirbheartaíocht ar ORFanna chun coinníollacha fostaíochta agus pá a rialáil in earnálacha fostaíochta áirithe

source: │Employment │EROs are negotiated by Joint Labour Committees to regulate conditions of │ │Regulation │employment and pay in certain employment sectors
ga: │Conradh ar théarma seasta │Ciallaíonn conradh ar théarma seasta conradhfostaíochta a chríochnaíonn ar dháta aontaithe

source: │Fixed-term │A fixed-term contract is a contract of employment which ends on an agreed date.│
ga: │Saoire Force Majeure │Saoire ón obaird’fhostaí ar chúiseanna práinneacha toisc duine den teaghlach a bheith breoite nó gortaithe

source: │Force majeure │Leave from work for an employee for urgent reasons because of the illness or │ │leave │injury of a family member
ga: │Saoráil Faisnéise (SF) │Ceadaíonn reachtaíocht SF duit rochtain a fháil ar thaifid atá coinnithe ag ranna rialtais agus ag comhlachtaí poiblí áirithe

source: │General │A General Employment Permit is a type of employment permit for certain │ │Employment │occupations a minimum annual salary of €30,000 and for a few jobs with salaries│ │Permit │below €30,000
ga: │Gnás casaoide │Leagtar amach anseo conas casaoid a dhéanamh faoi rud áirithe i do chuid téarmaí agus coinníollacha fostaíochta a bhfuil tionchar aige ort

source: │Grievance │This sets out how to complain about something in your employment terms and │ │procedure │conditions which affects you
ga: │Mí-iompar tromchúiseach │Tarlaíonn mí-iompar tromchúiseach san ionad oibre cosúil le hionsaí, gadaíocht, bulaíocht nó ciapadh

source: │ │Under employment equality legislation harassment on any of the 9 discriminatory│ │Harassment │grounds is illegal
ga: │Ciapadh │Faoin reachtaíocht um chomhionannas fostaíochta, tá ciapadh bunaithe ar cheann ar bith den 9 bhforas idirdhealaithe neamhdhleathacha

source: It is defined as behaviour “which has the purpose or effect│ │ │of violating a person’s dignity and creating an intimidating, hostile, │
ga: Déantar ciapadh a shainmhíniú mar a leanas sa dlí: “a bhfuil sé de chuspóir nó d’éifeacht aige dínit an duine a shárú agus timpeallacht bhagrach, naimhdeach, tháirchéimiúil, uiríslithe nó mhaslach a chruthú don duine sin”

source: │ │degrading, humiliating or offensive environment for the person”
ga: (ní leagan oifigiúil é seo) │

source: │Holiday │A holiday is paid time off work for rest and recreation
ga: │Saoire │Ciallaíonn saoire am saor ón obair atá íoctha le haghaidh laethanta le haghaidh scíthe nó áineasa

source: It can mean either │ │ │annual leave or a public holiday
ga: Is féidir le saoire bhliantúil nó saoire phoiblí a bheith i gceist leis

source: │Jobsharing │A type of flexible work where two people share the same employment position
ga: │Postroinnt │Cineál fostaíochta solúbtha ina ndéanann beirt an post céanna a roinnt le chéile

source: │Joint Labour │JLCs regulate conditions of employment in certain employment sectors. Their │
ga: │Comhchoistí Saothair (CCS) │Déanann CCSanna coinníollacha fostaíochta a rialáil in earnálacha fostaíochta áirithe

source: │Committees │agreements are called Employment Regulation Orders (EROs)
ga: Is Orduithe Rialaithe Fostaíochta (ORF) a thugtar ar na comhaontuithe seo

source: │Labour market │This is a requirement for most General Employment Permit applications. It means│
ga: │Tástáil riachtanas an mhargaidh saothair │Seo ceanglas a bhaineann le tromlach na n-iarratas ar chead oibre

source: │needs test │advertising a vacancy with the EURES employment network for 8 weeks and in │ │ │local and national newspapers for 6 days
ga: Ciallaíonn sé seo an folúntas a fhógairt le líonra fostaíochta EURES ar feadh 8 seachtaine agus sna nuachtáin áitiúla agus náisiúnta ar feadh 6 lá

source: │Lay off │Lay off is when you are let go from your job temporarily as your employer has │ │ │no work for you
ga: │Leagan as │Ciallaíonn Leagan as nuair a ligeann d’fhostóir leat mar fhostaí go sealadach toisc ganntanas oibre

source: Under employment rights legislation there │
ga: │Saoire │Cead le bheith as láthair ón obair

source: │Leave │are statutory entitlements to annual leave, maternity leave, adoptive leave, │ │ │parental leave and carer's leave
ga: Faoi reachtaíocht na gcearta fostaíochta, tá teidlíochtaí reachtúla ann maidir le saoire bhliantúil, saoire mháithreachais, saoire uchtaíoch, saoire do thuismitheoirí agussaoire cúramóra

source: │Maternity leave│Maternity leave is leave from work for a woman who is pregnant or who has just │ │ │given birth
ga: │Saoire mháithreachais │Ciallaíonn Saoire mháithreachais saoire do bhean atá ag iompar clainne nó atá díreach tar éis leanbh a thabhairt ar an saol

source: │Migrant worker │Someone who is not a national of the country where they are working
ga: │Spailpín fánach │Duine nach náisiúnach den tír ina bhfuil sé/sí ag obair é/í

source: │Minimum wage │This is a minimum hourly rate of pay
ga: │Íosphá │Seo é an t-íosráta pá de réir na huaire

source: Most employees have a legal right to the │ │ │national minimum wage (NMW)
ga: Tá ceart dlíthiúil ag tromlach na bhfostaithe ar íosphá náisiúnta

source: │Night work │Under the Organisation of Working Time Act 1997 night work means work done │ │ │between midnight and 7am
ga: │Obair oíche │Faoin Acht um Eagrú Ama Oibre, 1997 ciallaíonn obair oíche obair a dhéantar idir meán oíche agus 7rn

source: │Notice │Notice is an announcement by the employee or employer that the employment │ │ │contract will end on a certain date
ga: │Fógra │Ciallaíonn fógra fógra ó fhostaí nó ó fhostóir go bhfuil deireadh ag teacht le conradhfostaíochta ar dháta áirithe

source: │Open-ended │This is a contract of employment which continues until the employer or employee│ │contract │ends it
ga: │Conradh neamhiata │Seo conradh fostaíochta a leanann go dtí go gcuireann fostóir nó fostaí deireadh leis

source: It is known as a contract of indefinite duration
ga: Tugtar conradh ar thréimhse éiginnte air

source: This is what │ │ │employees often refer to as a permanent job
ga: Is minic a dhéanann fostaithe tagairt dá leithéid mar phost buan

source: │Overtime │Overtime is work done outside normal working hours
ga: │Ragobair │Is éard is ragobair ann ná obair a dhéantar lasmuigh de ghnáthuaireanta oibre

source: │ │When you leave your job your employer gives you a P45 form
ga: │P45 │Caithfidh an fostóir P45 a thabhairt duit nuair a fhágann tú post

source: It is a certificate│ │P45 │stating your pay, tax, USC and PRSI contributions deducted from the start of │ │ │the tax year to the last day of your job
ga: Is deimhniú é a shonraíonn na ranníocaíochtaí pá, cánach, MSU agus ÁSPC atá asbhainte ó thús na bliana cánach go dtí lá deiridh an phoist

source: │ │At the end of each tax year your employer gives you a P60 form. It is a │
ga: │P60 │Ag deireadh gach bliain cánach, tugann d’fhostóir foirm P60 duit

source: │P60 │certificate stating your pay, tax, USC and PRSI contributions deducted during │ │ │the year
ga: Is deimhniú é a shonraíonn na ranníocaíochtaí pá, cánach, MSU agus ÁSPC atá asbhainte i rith na bliana

source: │Parental leave │Parental leave is leave from work for parents of children aged under 8 (16 if │ │ │the child has a disability)
ga: │Saoire do thuismitheoirí │Ciallaíonn saoire do thuismitheoirí saoire ón obair do thuismitheoirí leanaí atá faoi bhun 8 mbliana d’aois (16 bliana d’aois má tá an leanbh faoi mhíchumas)

source: │Part-time │An employee whose normal hours of work are less than the normal hours of work │ │worker │of a comparable full-time employee
ga: │Oibrí páirtaimseartha │Fostaí le gnáthuaireanta oibre atá níos lú ná gnáthuaireanta oibre i gcomparáid le fostaí lánaimseartha

source: │ │Paternity leave is leave from work for a parent (other than the mother) │ │Paternity leave│following the birth or adoption of a child
ga: │Saoire atharthachta │Ciallaíonn saoire atharthachta saoire ón obair do thuismitheoir (seachas an mháthair) tar éis bhreithe nó uchtaithe linbh

source: There is a statutory entitlement to│ │ │paternity leave in respect of births or adoptions that occur on or after 1 │ │ │September 2016
ga: Tá teidlíocht reachtúil ar shaoire i leith bhreitheanna agus uchtuithe ar nó ón 1 Mheán Fómhair 2016

source: │PAYE │PAYE (Pay As You Earn) is the system where tax is deducted from your wages by │ │ │your employer and sent to the Revenue Commissioners
ga: │ÍMAT │Ciallaíonn ÍMAT (Íoc Mar a Thuillir) an córas ina ndéanann fostóir cáin a bhaint ó do phá agus a sheoladh ar aghaidh chuig na Coimisinéirí Ioncaim

source: │Pension │A pension is a payment from the State or a private company to someone who is │
ga: │Pinsean │Ciallaíonn pinsean íocaíocht a dhéanann an Stát nó cuideachta phríobháideach le duine atá ar scor

source: │PPS Number │all dealings with Government departments and other public bodies such as the │ │ │Revenue Commissioners
ga: │Tréimhse phromhaidh │Tréimhse ar leith ag tús na fostaíochta chun feiceáil an bhfuil fostaí oiriúnach don phost

source: │Probationary │A specified period at the start of an employment to see if the employee is │
ga: │CCSP │Ciallaíonn CCSPanna (Cuntas Coigiltis Scoir Pearsanta) cineál socraithe pinsin

source: │PRSA │PRSAs (Personal Retirement Savings Accounts) are a type of pension arrangement.│
ga: │ÁSPC │Ciallaíonn ÁSPC (Árachas Sóisialta Pá Coibhneasta) ranníocaíochtaí árachais shóisialta a dhéantar a asbhaint ó do phá

source: │ │PRSI (Pay Related Social Insurance) means the social insurance contributions │ │PRSI │deducted from your wages. Your PRSI contributions help you to qualify for │
ga: Cabhraíonn ranníocaíochtaí ÁSPC leat a bheith incháilithe d’íocaíochtaí leasa shóisialaigh cosúil le sochar breoiteachta

source: │ │There are 9 public holidays each year, for example, Christmas Day. The │
ga: │Saoirí poiblí │Bíonn 9 saoire phoiblí ann gach bliain, mar shampla, Lá Nollag

source: │Public holidays│statutory public holiday entitlement for employees is: either a paid day off, │ │ │an extra day of annual leave or a day's pay
ga: An teidlíocht reachtúil a bhaineann le saoir phoiblí na bhfostaithe ná: lá saor le híocaíocht, lá breise de shaoire bhliantúil nó lá íocaíochta

source: │Redundancy │Redundancy is when your job ceases to exist because of lack of work or your │ │ │company closing down
ga: │Iomarcaíocht │Ciallaíonn iomarcaíocht nuair a thagann deireadh le post toisc easpa oibre nó dúnadh na cuideachta

source: │Registered │REAs set out pay and conditions of employment in certain employment sectors
ga: Tá comhaontuithe comhchoiteann ann atá cláraithe leis an gCúirt Oibreachais

source: │Employment │They are collective agreements which have been registered with the Labour │ │Agreement (REA)│Court
ga: │Tréimhse sosa │Ciallaíonn tréimhse sosa tréimhse ar bith nach bhfuil leagtha amach mar thréimhse oibre

source: │Rest period │A rest period is any time that is not working time
ga: │Féinfhostaithe │Ciallaíonn duine féinfhostaithe duine ar bith a dhéanann a ngnó féin agus nach fostaí é/í

source: │Self-employed │A self-employed person is someone who carries on their own business and is not │ │ │an employee
ga: │Ciapadh gnéasach │Iompraíocht gan ghá de nádúr gnéasach le tionchar ar dhínit na mná agus na bhfear san ionad oibre – féach freisin ciapadh

source: │Sexual │Unwanted behaviour of a sexual nature that affects the dignity of women and men│ │harassment │at work – see also harassment
ga: │Gearr-am │Tarlaíonn sé seo nuair a ghearrtar do chuid uaireanta go dtí níos lú ná leath den ghnáthmhéid sheachtainiúil toisc go bhfuil níos lú obair le déanamh

source: │Short time │This is where your pay or hours reduced to less than half your normal weekly │ │ │amount because there is less work to be done
ga: │Conradh sainchuspóra │Conradh fostaíochta a chríochnaíonn nuair a chuirtear tasc ar leith i gcrích, nó nuair a tharlaíonn imeacht ar leith

source: │Partner/Spouse │partner, partner or dependant of a Critical Skills Employment Permit holder or │ │Employment │researcher
ga: │Ceardchumann │Ciallaíonn ceardchumann eagraíocht a dhéanann idirbheartaíocht le fostóir le haghaidh pá agus coinníollacha níos fearr

source: │Trade union │A trade union is an organisation which negotiates with an employer for better │ │ │pay and conditions
ga: │Aistriú gnólachta │Tarlaíonn aistriú gnólachta nuair a ghlacann comhlacht amháin seilbh ar chomhlacht eile nó nuair a thagann dhá chomhlacht le chéile

source: │Victimisation │Victimisation or penalisation is unfair treatment of a employee by an employer │
ga: │Pá │Pá is ea an t-airgead a íocann fostóir leat ar son na hoibre a dhéanann tú

source: │ │because of some action the worker has taken, such as claiming the minimum wage.│
ga: Tugtar tuarastal nó luach saothair ar an airgead seo freisin

source: ├───────────────┼───────────────────────────────────────────────────────────────────────────────┤ │ │Wages are the money paid to you by your employer for your work
ga: Is féidir buntáistí eile a áireamh mar chuid den phá uaireanta, mar shampla cothú agus iostas, má bhíonn siad soláthraithe ag an bhfostóir mar chuid den chonradh fostaíochta atá agat

source: │ │included to make up your wages, for example board and lodging, if supplied by │ │ │your employer and are part of your employment contract
ga: │Cead Fostaíochta Ginearálta │Ciallaíonn Cead Fostaíochta Ginearálta cineál ceada fostaíochta do ghairmeacha áirithe sa raon tuarastail bhliantúil ó €30,000 agus i gcás post áirithe le tuarastail faoi bhun €30,000

source: │Working hours │This means the time when you are working
ga: │Uaireanta oibre │Ciallaíonn sé seo an t-am a bhímid ag obair

source: For most employees the legal maximum │ │ │average working week is 48 hours
ga: De ghnáth is é 48 uair an chloig an tseachtain oibre uasta ar an meán

source: │Written terms │Although all your contract of employment does not have to be written, you have │ │of employment │a legal right to a written statement of certain employment terms
ga: │Téarmaí scríofa na fostaíochta │Cé nach gcaithfidh do chonradh fostaíochta a bheith scríofa, tá ceart dlíthiúil agat ar ráiteas scríofa maidir le téarmaí fostaíochta áirithe
